IDENTIFICATION DIVISION.
PROGRAM-ID. EX_ADD_VAR.

DATA DIVISION.
WORKING-STORAGE SECTION.
        01 NB1 PIC 99 VALUE 10.
        01 NB2 PIC 99 VALUE 5.
        01 RESULTAT PIC 99.

PROCEDURE DIVISION.
        ADD NB1 TO NB2 GIVING RESULTAT.
        DISPLAY RESULTAT.
        STOP RUN.
