IDENTIFICATION DIVISION.
PROGRAM-ID. EX_BOUCLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
      01 ITERATION PIC 9 VALUE 0.

PROCEDURE DIVISION.
      PERFORM 5 TIMES
        ADD 1 TO ITERATION
        DISPLAY "Itérations : " ITERATION
      END-PERFORM.

      STOP RUN.
