IDENTIFICATION DIVISION.
PROGRAM-ID. EX_CONDITION.

DATA DIVISION.
WORKING-STORAGE SECTION.
      01 AGE PIC 99.

PROCEDURE DIVISION.
      DISPLAY "Rentrez votre age : ".
      ACCEPT AGE.

      IF AGE >= 18 AND AGE <= 60
        DISPLAY "Age valide."
      ELSE
        DISPLAY "Age non valide."
      END-IF.

      STOP RUN.
