IDENTIFICATION DIVISION.
PROGRAM-ID. EX_DIFFERENT_CAL_VAR.

DATA DIVISION.
WORKING-STORAGE SECTION.
      01 NB1 PIC 99 VALUE 10.
      01 NB2 PIC 99 VALUE 5.

      01 RESULTATS.
        05 RES_ADDITION PIC 99.
        05 RES_SOUSTRACTION PIC 99.
        05 RES_MULTIPLICATION PIC 99.
        05 RES_DIVISION PIC 99.
        05 RES_RESTE PIC 99.
        05 RES_COMPUTE PIC 99.

PROCEDURE DIVISION.
      DISPLAY "Nombre 1 : " NB1.
      DISPLAY "Nombre 2 : " NB2.

      ADD  NB1 TO NB2 GIVING RES_ADDITION.
      SUBTRACT NB1 FROM NB2 GIVING RES_SOUSTRACTION.
      MULTIPLY NB1 BY NB2 GIVING RES_MULTIPLICATION.
      DIVIDE NB1 BY NB2 GIVING RES_DIVISION REMAINDER RES_RESTE.
      COMPUTE RES_COMPUTE = ( NB1 + NB2 ) * 2.

      DISPLAY "Le résultat de " NB1 " + " NB2 " = " RES_ADDITION.
      DISPLAY "Le résultat de " NB1 " - " NB2 " = " RES_SOUSTRACTION.
      DISPLAY "Le résultat de " NB1 " * " NB2 " = " RES_MULTIPLICATIO.
      DISPLAY "Le résultat de " NB1 " / " NB2 " =" RES_DIVISION.
      DISPLAY "Le reste de " NB1 " / " NB2 " = " RES_RESTE.
      DISPLAY "Le résultat de ( " NB1 " + " NB2 " ) * 2 = " RES_COMPUTE.
      STOP RUN.
      
      
