IDENTIFICATION DIVISION.
PROGRAM-ID. EX_DIFFERENT_CAL_VAR.

DATA DIVISION.
WORKING-STORAGE SECTION.
      01 NB1 PIC 99 VALUE 10.
      01 NB2 PIC 99 VALUE 5.

      01 RESULTATS.
        05 RES_ADDITION PIC 99.
        05 RES_SOUSTRACTION PIC 99.
        05 RES_MULTIPLICATION PIC 99.
        05 RES_DIVISION PIC 99.

PRECEDURE DIVISION.
      DISPLAY RESULTATS.
