IDENTIFICATION DIVISION.
PROGRAM-ID. EX_IMBRICATION_VAR.

DATA DIVISION.
WORKING-STORAGE SECTION.
      01 EMPLOYE.
        05 NOM PIC X(10) VALUE "Bob".
        05 AGE PIC 99 VALUE 10.

PROCEDURE DIVISION.
      DISPLAY "Nom : " NOM.
      DISPLAY "Age : " AGE.

      MOVE 45 TO AGE.
      DISPLAY "Age une fois modifier : " AGE.
