IDENTIFICATION DIVISION.
PROGRAM-ID. EX_MODIFIE_VAR.

DATA VISION.
WORKING STORAGE SECTION.
      SALAIRE PIC 9(5)V99 VALUE 1000.50.

PROCEDURE DIVISION.
      DISPLAY "Salaire avant modification : " SALAIRE.
      MOVE 1500.75 TO SALAIRE
      DISPLAY "Salaire après modification : " SALAIRE.
      STOP RUN.
