IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCICE-VARIABLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PRENOM PIC X(10) VALUE "Alice".
01 AGE    PIC 99 VALUE 25.

PROCEDURE DIVISION.
        DISPLAY "Prenom : " PRENOM.
        DISPLAY "Age : " AGE.
        STOP RUN.
