>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. SAISIE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NOM PIC A(20).
01 AGE PIC 99.

PROCEDURE DIVISION.
    DISPLAY "Entrez votre nom : ".
    ACCEPT NOM.
    DISPLAY "Entrez votre age : ".
    ACCEPT AGE.

    DISPLAY "Bonjour " NOM ", vous avez " AGE " ans.".
    STOP RUN.
